touch/uaai.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://virginmedia/schema/RequestHeader/2/0" xmlns:ns1="http://virginmedia/schema/UpdateAdditionalAccountInformation/1/0">
   <soapenv:Header>
      <ns:RequestHeader>
         <ns:activityName>?</ns:activityName>
         <!--Optional:-->
         <ns:msgType>?</ns:msgType>
         <ns:senderURI>?</ns:senderURI>
         <!--Optional:-->
         <ns:originatorURI>?</ns:originatorURI>
         <!--Optional:-->
         <ns:replyToURI>?</ns:replyToURI>
         <!--Optional:-->
         <ns:failureToURI>?</ns:failureToURI>
         <ns:userid>?</ns:userid>
         <!--Optional:-->
         <ns:security>?</ns:security>
         <!--Optional:-->
         <ns:securityType>?</ns:securityType>
         <ns:requestTimestamp>?</ns:requestTimestamp>
         <!--Optional:-->
         <ns:communicationPattern>?</ns:communicationPattern>
         <!--Optional:-->
         <ns:communicationStyle>?</ns:communicationStyle>
         <!--Optional:-->
         <ns:service>?</ns:service>
         <!--Optional:-->
         <ns:version>?</ns:version>
         <!--Optional:-->
         <ns:businessID>?</ns:businessID>
         <ns:conversationID>?</ns:conversationID>
         <ns:requestID>?</ns:requestID>
         <!--Optional:-->
         <ns:messageID>?</ns:messageID>
      </ns:RequestHeader>
   </soapenv:Header>
   <soapenv:Body><ns1:UpdateAdditionalAccountInformationRequest>
         <ns1:accountIdnetification>
            <ns1:accountNumber>?</ns1:accountNumber>
            <ns1:siteReference>?</ns1:siteReference>
         </ns1:accountIdnetification>
         <!--Optional:-->
         <ns1:customerEmailAddress>?</ns1:customerEmailAddress>
         <!--Optional:-->
         <ns1:eBillingEmailAddress>?</ns1:eBillingEmailAddress>
         <!--Optional:-->
         <ns1:virginMediaMarketingConsent>?</ns1:virginMediaMarketingConsent>
         <!--Optional:-->
         <ns1:virginGroupMarketingConsent>?</ns1:virginGroupMarketingConsent>
         <!--Optional:-->
         <ns1:customerAccountAccess>
            <ns1:password>?</ns1:password>
            <ns1:passwordReminderQuestion>?</ns1:passwordReminderQuestion>
         </ns1:customerAccountAccess>
         <!--Optional:-->
         <ns1:customerCreditProfile>
            <ns1:channelName>?</ns1:channelName>
            <ns1:transactionIdentifier>?</ns1:transactionIdentifier>
            <ns1:customerAgreedToCreditCheck>?</ns1:customerAgreedToCreditCheck>
            <ns1:creditProfileDate>?</ns1:creditProfileDate>
            <ns1:creditScore>?</ns1:creditScore>
            <ns1:scoreText>?</ns1:scoreText>
            <ns1:recommendedDecision>?</ns1:recommendedDecision>
            <!--Zero or more repetitions:-->
            <ns1:creditCheckrecommendations>
               <!--Optional:-->
               <ns1:productLineDescription>?</ns1:productLineDescription>
               <!--Optional:-->
               <ns1:recommendedPrepayment>?</ns1:recommendedPrepayment>
               <!--Optional:-->
               <ns1:recommendedCreditLimit>?</ns1:recommendedCreditLimit>
               <!--Optional:-->
               <ns1:recommendedDeposit>?</ns1:recommendedDeposit>
               <!--Optional:-->
               <ns1:recommendedServiceRestriction>?</ns1:recommendedServiceRestriction>
               <!--Optional:-->
               <ns1:recommendationText>?</ns1:recommendationText>
               <!--Optional:-->
               <ns1:recommendedCreditCeiling>?</ns1:recommendedCreditCeiling>
               <!--Optional:-->
               <ns1:recommendedUnitLimit>?</ns1:recommendedUnitLimit>
               <!--Optional:-->
               <ns1:scoreBand>?</ns1:scoreBand>
            </ns1:creditCheckrecommendations>
            <!--Optional:-->
            <ns1:creditCheckAdditionalInformation>
               <ns1:scoreCard>?</ns1:scoreCard>
               <ns1:scoreCardSplit>?</ns1:scoreCardSplit>
               <!--Optional:-->
               <ns1:promoteMobile>?</ns1:promoteMobile>
               <!--Optional:-->
               <ns1:depositEnabled>?</ns1:depositEnabled>
            </ns1:creditCheckAdditionalInformation>
            <ns1:residenceHistory>
               <ns1:currentPlaceOfResidence>
                  <ns1:yearsAtResidence>?</ns1:yearsAtResidence>
                  <ns1:monthsAtResidence>?</ns1:monthsAtResidence>
                  <ns1:statusOfResidence>?</ns1:statusOfResidence>
                  <ns1:Address>
                     <!--Optional:-->
                     <ns1:subBuildingName>?</ns1:subBuildingName>
                     <!--Optional:-->
                     <ns1:buildingName>?</ns1:buildingName>
                     <!--Optional:-->
                     <ns1:streetNumber>?</ns1:streetNumber>
                     <!--Optional:-->
                     <ns1:street>?</ns1:street>
                     <!--Optional:-->
                     <ns1:locality>?</ns1:locality>
                     <!--Optional:-->
                     <ns1:posttown>?</ns1:posttown>
                     <!--Optional:-->
                     <ns1:county>?</ns1:county>
                     <ns1:postcode>?</ns1:postcode>
                     <!--Optional:-->
                     <ns1:countryCode>?</ns1:countryCode>
                  </ns1:Address>
               </ns1:currentPlaceOfResidence>
               <!--Optional:-->
               <ns1:previousPlaceOfResidence1>
                  <ns1:yearsAtResidence>?</ns1:yearsAtResidence>
                  <ns1:monthsAtResidence>?</ns1:monthsAtResidence>
                  <ns1:statusOfResidence>?</ns1:statusOfResidence>
                  <ns1:Address>
                     <!--Optional:-->
                     <ns1:subBuildingName>?</ns1:subBuildingName>
                     <!--Optional:-->
                     <ns1:buildingName>?</ns1:buildingName>
                     <!--Optional:-->
                     <ns1:streetNumber>?</ns1:streetNumber>
                     <!--Optional:-->
                     <ns1:street>?</ns1:street>
                     <!--Optional:-->
                     <ns1:locality>?</ns1:locality>
                     <!--Optional:-->
                     <ns1:posttown>?</ns1:posttown>
                     <!--Optional:-->
                     <ns1:county>?</ns1:county>
                     <ns1:postcode>?</ns1:postcode>
                     <!--Optional:-->
                     <ns1:countryCode>?</ns1:countryCode>
                  </ns1:Address>
               </ns1:previousPlaceOfResidence1>
               <!--Optional:-->
               <ns1:previousPlaceOfResidence2>
                  <ns1:yearsAtResidence>?</ns1:yearsAtResidence>
                  <ns1:monthsAtResidence>?</ns1:monthsAtResidence>
                  <ns1:statusOfResidence>?</ns1:statusOfResidence>
                  <ns1:Address>
                     <!--Optional:-->
                     <ns1:subBuildingName>?</ns1:subBuildingName>
                     <!--Optional:-->
                     <ns1:buildingName>?</ns1:buildingName>
                     <!--Optional:-->
                     <ns1:streetNumber>?</ns1:streetNumber>
                     <!--Optional:-->
                     <ns1:street>?</ns1:street>
                     <!--Optional:-->
                     <ns1:locality>?</ns1:locality>
                     <!--Optional:-->
                     <ns1:posttown>?</ns1:posttown>
                     <!--Optional:-->
                     <ns1:county>?</ns1:county>
                     <ns1:postcode>?</ns1:postcode>
                     <!--Optional:-->
                     <ns1:countryCode>?</ns1:countryCode>
                  </ns1:Address>
               </ns1:previousPlaceOfResidence2>
            </ns1:residenceHistory>
         </ns1:customerCreditProfile>
         <!--Optional:-->
         <ns1:setDigitalServiceFlag>?</ns1:setDigitalServiceFlag>
      </ns1:UpdateAdditionalAccountInformationRequest>
   </soapenv:Body>
</soapenv:Envelope>